import styles from "./InfoPage.module.scss";
import VerticalPad from "components/ui/VerticalPad.tsx";

const InfoPage = () => {
    return <div className={styles.InfoPage}>
        <h1>Наші послуги – EasyStay</h1>

        <p>Ласкаво просимо до EasyStay – вашого надійного партнера для зручних і незабутніх подорожей. Ми пропонуємо
            широкий спектр послуг, які допоможуть зробити вашу подорож комфортною, легкою та безтурботною. Ознайомтесь
            із нашими пропозиціями:</p>

        <h2>Бронювання житла</h2>

        <p>Ми пропонуємо зручний сервіс для бронювання готелів, апартаментів і вілл по всьому світу. Ви можете легко
            знайти ідеальний варіант проживання для будь-якого бюджету та потреб, будь це короткочасна подорож чи
            тривалий відпочинок. Завдяки простому пошуку, фільтрам і реальним відгукам ви завжди знайдете те, що вам
            потрібно.</p>

        <h2>Оренда автомобілів</h2>

        <p>Зробіть свою подорож ще більш гнучкою та комфортною завдяки оренді автомобіля. EasyStay пропонує широкий
            вибір транспортних засобів: від компактних авто для міських поїздок до просторих позашляховиків для сімейних
            подорожей. Ми працюємо з надійними партнерами, щоб гарантувати високу якість та доступні ціни.</p>

        <h2>Апартаменти</h2>

        <p>Для тих, хто цінує комфорт і затишок, ми пропонуємо великий вибір апартаментів. Просторі приміщення,
            обладнані кухнею, вітальнею і з усім необхідним для самостійного проживання, стануть вашим домом далеко від
            дому. Ви можете обрати апартаменти з різними опціями – від бюджетних до розкішних варіантів.</p>

        <h2>Трансфери</h2>

        <p>Ми допоможемо вам швидко та зручно дістатися до місця призначення. EasyStay організовує трансфери з
            аеропортів, вокзалів і навіть між містами. Ви можете обрати індивідуальний або груповий трансфер залежно від
            ваших потреб. Надійність, пунктуальність та комфорт гарантовано.</p>

        <h2>Тури</h2>

        <p>Відкривайте для себе світ разом з EasyStay! Ми пропонуємо організовані тури до найцікавіших куточків світу.
            Наші маршрути включають все: від екскурсій популярними туристичними об'єктами до унікальних пригод, які
            розкриють автентичну атмосферу країни. Просто оберіть напрямок, а ми подбаємо про все інше.</p>

        <VerticalPad heightPx={60} />

        <p>Ми прагнемо зробити ваші подорожі максимально приємними та простими. EasyStay – це сервіс, який поєднує
            якість, надійність і доступність. Обирайте послуги, які відповідають вашим потребам, і насолоджуйтеся
            ідеальною подорожжю разом з нами!</p>
    </div>;
};

export default InfoPage;